system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration    | Version:  8                                      |
|   \\  /    A nd          | Web:      www.OpenFOAM.com                       |
|    \\/     M anipulation |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration    | Version:  8                                      |
|   \\  /    A nd          | Web:      www.OpenFOAM.com                       |
|    \\/     M anipulation |                                                 |
\*---------------------------------------------------------------------------*/
application     blockMesh;
startFrom        firstTime;
startTime        0;
stopAt           endTime;
endTime          2;
deltaT           1;
writeControl     timeStep;
writeInterval    1;
purgeWrite       0;
writeFormat      ascii;
writePrecision   6;
writeCompression off;
timeFormat       general;
timePrecision    6;
runTimeModifiable yes;

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration    | Version:  8                                      |
|   \\  /    A nd          | Web:      www.OpenFOAM.com                       |
|    \\/     M anipulation |                                                 |
\*---------------------------------------------------------------------------*/
functions
{
}
