system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration    | Version:  8                                      |
|   \\  /    A nd          | Web:      www.OpenFOAM.com                       |
|    \\/     M anipulation |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.2 -0.2 -0.2)
    ( 0.2 -0.2 -0.2)
    ( 0.2  0.2 -0.2)
    (-0.2  0.2 -0.2)
    (-0.2 -0.2 0.2)
    ( 0.2 -0.2 0.2)
    ( 0.2  0.2 0.2)
    (-0.2  0.2 0.2)
);

edges
(
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);

boundary
(
    back
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    front
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

