constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    back
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       9817;
    }
    front
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       9917;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       10017;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       10117;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       10217;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       10317;
    }
    sand_clock
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          64;
        startFace       10417;
    }
)

// ************************************************************************* //
